ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32F1QI/inc/MDR32F1QI.h

/**
  * FILE MDR32F1QI.h
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32F1QI_H
#define __MDR32F1QI_H

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @addtogroup MDR32F1QI MDR32F1QI
  * @{
  */

/** @addtogroup MDR32F1QI_Peripheral MDR32F1QI Peripheral
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/**
  * @brief MDR32F1QI Interrupt Number Definition
  */

typedef enum IRQn
{
/*----- Processor Exceptions Numbers -------------------------------=-----------*/
  NonMaskableInt_IRQn         = -14,    /*!< 2 Non Maskable Interrupt           */
  HardFault_IRQn              = -13,    /*!< 3 Hard Fault Interrupt             */
  SVCall_IRQn                 = -5,     /*!< 11 SV Call Interrupt               */
  PendSV_IRQn                 = -2,     /*!< 14 Pend SV Interrupt               */
  SysTick_IRQn                = -1,     /*!< 15 System Tick Interrupt           */

/*----- MDR32F1QI specific Interrupt Numbers -------------------------------------*/
  MIL_STD_1553B2_IRQn         = 0,      /*!< MIL_STD_1553B2 Interrupt           */
  MIL_STD_1553B1_IRQn         = 1,      /*!< MIL_STD_1553B1 Interrupt           */
  USB_IRQn                    = 2,      /*!< USB Host Interrupt                 */
  CAN1_IRQn                   = 3,      /*!< CAN1 Interrupt                     */
  CAN2_IRQn                   = 4,      /*!< CAN2 Interrupt                     */
  DMA_IRQn                    = 5,      /*!< DMA Interrupt                      */
  UART1_IRQn                  = 6,      /*!< UART1 Interrupt                    */
  UART2_IRQn                  = 7,      /*!< UART2 Interrupt                    */
  SSP1_IRQn                   = 8,      /*!< SSP1 Interrupt                     */
  BUSY_IRQn                   = 9,      /*!< BUSY Interrupt                     */
  ARINC429R_IRQn              = 10,     /*!< ARINC429 Receiver Interrupt        */
  POWER_IRQn                  = 11,     /*!< POWER Detecor Interrupt            */
  WWDG_IRQn                   = 12,     /*!< Window Watchdog Interrupt          */
  TIMER4_IRQn                 = 13,     /*!< Timer4 Interrupt                   */
  TIMER1_IRQn                 = 14,     /*!< Timer1 Interrupt                   */
  TIMER2_IRQn                 = 15,     /*!< Timer2 Interrupt                   */
  TIMER3_IRQn                 = 16,     /*!< Timer3 Interrupt                   */
  ADC_IRQn                    = 17,     /*!< ADC Interrupt                      */
  ETHERNET_IRQn               = 18,     /*!< Ethernet Interrupt                 */
  SSP3_IRQn                   = 19,     /*!< SSP3 Interrupt                     */
  SSP2_IRQn                   = 20,     /*!< SSP2 Interrupt                     */
  ARINC429T1_IRQn             = 21,     /*!< ARINC429 Transmitter 1 Interrupt   */
  ARINC429T2_IRQn             = 22,     /*!< ARINC429 Transmitter 2 Interrupt   */
  ARINC429T3_IRQn             = 23,     /*!< ARINC429 Transmitter 3 Interrupt   */
  ARINC429T4_IRQn             = 24,     /*!< ARINC429 Transmitter 4 Interrupt   */
  BKP_IRQn                    = 27,     /*!< BACKUP Interrupt                   */
  EXT_INT1_IRQn               = 28,     /*!< EXT_INT1 Interrupt                 */
  EXT_INT2_IRQn               = 29,     /*!< EXT_INT2 Interrupt                 */
  EXT_INT3_IRQn               = 30,     /*!< EXT_INT3 Interrupt                 */
  EXT_INT4_IRQn               = 31      /*!< EXT_INT4 Interrupt                 */
}IRQn_Type;

/** @addtogroup __MDR32F1QI___Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */
/* Configuration of the Processor and Core Peripherals */
#define __CM1_REV              0x0102   /*!< Core Revision                                */
#define __MPU_PRESENT             0     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          2     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* __Configuration_of_CMSIS */

/* Includes ------------------------------------------------------------------*/
#include "MDR32FxQI_config.h"
#include "core_cm1.h"
#include "system_MDR32F1QI.h"

/** @defgroup __MDR32F1QI___Exported_types Exported types
  * @{
  */
typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus, BitStatus;

#define IS_BIT_STATUS(STATUS)	(((STATUS) == RESET) || ((STATUS) == SET))

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __Exported_types */

/** @defgroup __MDR32F1QI_Peripheral_Units MDR32F1QI Peripheral Units
  * @{
  */

/** @defgroup __MDR32F1QI_Periph_CAN CAN
  * @{
  */

/** @defgroup __MDR32F1QI_CAN_Data_Structures Data Structures
  * @{
  */

/* MDR_CAN_BUF_TypeDef structure */
typedef struct
{
  __IO uint32_t ID;
  __IO uint32_t DLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
}MDR_CAN_BUF_TypeDef;

/* MDR_CAN_BUF_FILTER_TypeDef structure */
typedef struct
{
  __IO uint32_t MASK;
  __IO uint32_t FILTER;
}MDR_CAN_BUF_FILTER_TypeDef;

/* MDR_CAN_TypeDef structure */
typedef struct
{
  __IO uint32_t CONTROL;
  __IO uint32_t STATUS;
  __IO uint32_t BITTMNG;
       uint32_t RESERVED0;
  __IO uint32_t INT_EN;
       uint32_t RESERVED1[2];
  __IO uint32_t OVER;
  __IO uint32_t RXID;
  __IO uint32_t RXDLC;
  __IO uint32_t RXDATAL;
  __IO uint32_t RXDATAH;
  __IO uint32_t TXID;
  __IO uint32_t TXDLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
  __IO uint32_t BUF_CON[32];
  __IO uint32_t INT_RX;
  __IO uint32_t RX;
  __IO uint32_t INT_TX;
  __IO uint32_t TX;
       uint32_t RESERVED2[76];
    MDR_CAN_BUF_TypeDef CAN_BUF[32];
       uint32_t RESERVED3[64];
    MDR_CAN_BUF_FILTER_TypeDef CAN_BUF_FILTER[32];
}MDR_CAN_TypeDef;

/** @} */ /* End of group __MDR32F1QI_CAN_Data_Structures */

