ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR32FxQI/DeviceSupport/MDR32F1QI/inc/MDR32F1QI.h
/** @defgroup __MDR32F1QI_Periph_ETH_PHY_STATUS	ETH PHY STATUS
  * @{
  */ 

/*-- ETH_PHY_STATUS: ETH PHY_STATUS Register -----*/
/* Bit field positions: */
#define ETH_PHY_STATUS_LED0_Pos			0
#define ETH_PHY_STATUS_LED1_Pos			1
#define ETH_PHY_STATUS_LED2_Pos			2
#define ETH_PHY_STATUS_LED3_Pos			3
#define ETH_PHY_STATUS_READY_Pos		4
#define ETH_PHY_STATUS_CRS_Pos			5
#define ETH_PHY_STATUS_COL_Pos			6
#define ETH_PHY_STATUS_FX_VALID_Pos		8
#define ETH_PHY_STATUS_MDO_Pos			9
#define ETH_PHY_STATUS_MDINT_Pos		10

/* Bit field masks: */
#define ETH_PHY_STATUS_LED0				((uint32_t)0x00000001)
#define ETH_PHY_STATUS_LED1				((uint32_t)0x00000002)
#define ETH_PHY_STATUS_LED2				((uint32_t)0x00000004)
#define ETH_PHY_STATUS_LED3				((uint32_t)0x00000008)
#define ETH_PHY_STATUS_READY			((uint32_t)0x00000010)
#define ETH_PHY_STATUS_CRS				((uint32_t)0x00000020)
#define ETH_PHY_STATUS_COL_Msk			((uint32_t)0x000000C0)
#define ETH_PHY_STATUS_FX_VALID			((uint32_t)0x00000100)
#define ETH_PHY_STATUS_MDO				((uint32_t)0x00000200)
#define ETH_PHY_STATUS_MDINT			((uint32_t)0x00000400)

/** @} */ /* End of group ETH_PHY_STATUS */

/** @} */ /* End of group __MDR32F1QI_Periph_ETHERNET Defines */

/** @} */ /* End of group __MDR32F1QI_Periph_ETHERNET */

/** @} */ /* End of group __MDR32F1QI_Peripheral_Units */


/** @defgroup __MDR32F1QI___Peripheral_Memory_Map Peripheral Memory Map
  * @{
  */

#define MDR_CAN1_BASE			  (0x40000000)	// 0
#define MDR_CAN2_BASE			  (0x40008000)	// 1
#define MDR_USB_BASE			  (0x40010000)	// 2
#define MDR_EEPROM_BASE 		  (0x40018000)	// 3
#define MDR_RST_CLK_BASE		  (0x40020000)	// 4
#define MDR_DMA_BASE			  (0x40028000)	// 5
#define MDR_UART1_BASE			  (0x40030000)	// 6
#define MDR_UART2_BASE			  (0x40038000)	// 7
#define MDR_SSP1_BASE			  (0x40040000)	// 8
#define MDR_MIL_STD_15531_BASE	  (0x40048000)	// 9
#define MDR_MIL_STD_15532_BASE	  (0x40050000)	// 10
#define MDR_POWER_BASE			  (0x40058000)	// 11
#define MDR_WWDG_BASE			  (0x40060000)	// 12
#define MDR_IWDG_BASE			  (0x40068000)	// 13
#define MDR_TIMER1_BASE 		  (0x40070000)	// 14
#define MDR_TIMER2_BASE 		  (0x40078000) 	// 15
#define MDR_TIMER3_BASE 		  (0x40080000)	// 16
#define MDR_ADC_BASE			  (0x40088000)	// 17
#define MDR_DAC_BASE			  (0x40090000)	// 18
#define MDR_TIMER4_BASE 		  (0x40098000)	// 19
#define MDR_SSP2_BASE			  (0x400A0000)	// 20
#define MDR_PORTA_BASE			  (0x400A8000)	// 21
#define MDR_PORTB_BASE			  (0x400B0000)	// 22
#define MDR_PORTC_BASE			  (0x400B8000)	// 23
#define MDR_PORTD_BASE			  (0x400C0000)	// 24
#define MDR_PORTE_BASE			  (0x400C8000)  // 25
#define MDR_ARINC429R_BASE		  (0x400D0000)	// 26
#define MDR_BKP_BASE			  (0x400D8000)	// 27
#define MDR_ARINC429T_BASE		  (0x400E0000)  // 28
#define MDR_PORTF_BASE			  (0x400E8000)	// 29
#define MDR_EBC_BASE	 	      (0x400F0000)	// 30
#define MDR_SSP3_BASE			  (0x400F8000)	// 31
#define MDR_ETHERNET1_BASE		  (0x30000000)
#define MDR_SYS_BASE			  (0xE000E000)

/** @} */ /* End of group __Peripheral_Memory_Map */

/** @defgroup __MDR32F1QI___Peripheral_declaration Peripheral declaration
  * @{
  */

#define MDR_CAN1				  ((MDR_CAN_TypeDef 		  *)MDR_CAN1_BASE		  )
#define MDR_CAN2				  ((MDR_CAN_TypeDef 		  *)MDR_CAN2_BASE		  )
#define MDR_USB 				  ((MDR_USB_TypeDef 		  *)MDR_USB_BASE		  )
#define MDR_EEPROM				  ((MDR_EEPROM_TypeDef		  *)MDR_EEPROM_BASE 	  )
#define MDR_RST_CLK 			  ((MDR_RST_CLK_TypeDef 	  *)MDR_RST_CLK_BASE	  )
#define MDR_DMA 				  ((MDR_DMA_TypeDef 		  *)MDR_DMA_BASE		  )
#define MDR_UART1				  ((MDR_UART_TypeDef		  *)MDR_UART1_BASE		  )
#define MDR_UART2				  ((MDR_UART_TypeDef		  *)MDR_UART2_BASE		  )
#define MDR_SSP1				  ((MDR_SSP_TypeDef 		  *)MDR_SSP1_BASE		  )
#define MDR_MIL_STD_15531		  ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15531_BASE)
#define MDR_MIL_STD_15532		  ((MDR_MIL_STD_1553_TypeDef  *)MDR_MIL_STD_15532_BASE)
#define MDR_POWER				  ((MDR_POWER_TypeDef		  *)MDR_POWER_BASE		  )
#define MDR_WWDG				  ((MDR_WWDG_TypeDef		  *)MDR_WWDG_BASE		  )
#define MDR_IWDG				  ((MDR_IWDG_TypeDef		  *)MDR_IWDG_BASE		  )
#define MDR_TIMER1				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER1_BASE 	  )
#define MDR_TIMER2				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER2_BASE 	  )
#define MDR_TIMER3				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER3_BASE 	  )
#define MDR_ADC 				  ((MDR_ADC_TypeDef 		  *)MDR_ADC_BASE		  )
#define MDR_DAC 				  ((MDR_DAC_TypeDef 		  *)MDR_DAC_BASE		  )
#define MDR_TIMER4				  ((MDR_TIMER_TypeDef		  *)MDR_TIMER4_BASE 	  )
#define MDR_SSP2				  ((MDR_SSP_TypeDef 		  *)MDR_SSP2_BASE		  )
#define MDR_PORTA				  ((MDR_PORT_TypeDef		  *)MDR_PORTA_BASE		  )
#define MDR_PORTB				  ((MDR_PORT_TypeDef		  *)MDR_PORTB_BASE		  )
#define MDR_PORTC				  ((MDR_PORT_TypeDef		  *)MDR_PORTC_BASE		  )
#define MDR_PORTD				  ((MDR_PORT_TypeDef		  *)MDR_PORTD_BASE		  )
#define MDR_PORTE				  ((MDR_PORT_TypeDef		  *)MDR_PORTE_BASE		  )
#define MDR_ARINC429R			  ((MDR_ARINC429R_TypeDef	  *)MDR_ARINC429R_BASE	  )
#define MDR_BKP 				  ((MDR_BKP_TypeDef 		  *)MDR_BKP_BASE		  )
#define MDR_ARINC429T			  ((MDR_ARINC429T_TypeDef	  *)MDR_ARINC429T_BASE	  )
#define MDR_PORTF				  ((MDR_PORT_TypeDef		  *)MDR_PORTF_BASE		  )
#define MDR_EBC		  			  ((MDR_EBC_TypeDef           *)MDR_EBC_BASE          )
#define MDR_SSP3				  ((MDR_SSP_TypeDef 		  *)MDR_SSP3_BASE		  )
#define MDR_ETHERNET1			  ((MDR_ETHERNET_TypeDef	  *)MDR_ETHERNET1_BASE	  )
#define MDR_SYS 				  ((MDR_SYS_TypeDef 		  *)MDR_SYS_BASE		  )

/** @} */ /* End of group __Peripheral_declaration */

/** @} */ /* End of group MDR32F1QI_Peripheral MDR32F1QI Peripheral */

/** @} */ /* End of group MDR32F1QI */

/** @} */ /* End of group __CMSIS */

#ifdef __cplusplus
}
#endif

#endif /* __MDR32F1QI_H */

/*
*
* END OF FILE MDR32F1QI.h */



